EDT/ZUP/zup_edt/src/Documents/ЗаявкаНаОбучениеРазвитие/ЗаявкаНаОбучениеРазвитие.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаНаОбучениеРазвитие</name>
  <basedOn>Catalog.МероприятияОбученияРазвития</basedOn>
  <basedOn>Document.ЗаявкаНаВключениеВПланОбучения</basedOn>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Мероприятие</name>
    <type>
      <types>CatalogRef.МероприятияОбученияРазвития</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаРасходов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СостоянияСогласования</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткийСоставДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Расходы</name>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ХарактеристикиПерсонала</name>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ХарактеристикиПерсонала</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ФизическиеЛица</name>
    <attributes>
      <name>ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьКомпетенции</name>
    <attributes>
      <name>Компетенция</name>
      <type>
        <types>CatalogRef.КомпетенцииПерсонала</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/ZUP/zup_edt/src/Documents/ЗаявкаНаОбучениеРазвитие/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий	

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	СуммаРасходов = Расходы.Итог("Сумма");
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Статус = ПредопределенноеЗначение("Перечисление.СостоянияСогласования.Отклонено") Тогда
		ПроверяемыеРеквизиты.Очистить();
		Возврат;
	КонецЕсли;
	
	ЗарплатаКадры.ПроверитьКорректностьДаты(Ссылка, ДатаНачала, "Объект.ДатаНачала", Отказ, НСтр("ru='Дата начала'"), , , Ложь);
	
	Ошибки = Неопределено;
	МассивНепроверяемыхРеквизитов = Новый Массив();
	
	Если ДатаНачала > ДатаОкончания Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru ='Неверно заполнен период заявки'"), ЭтотОбъект, "ДатаНачала",, Отказ);
		МассивНепроверяемыхРеквизитов.Добавить("ДатаНачала");
		МассивНепроверяемыхРеквизитов.Добавить("ДатаОкончания");
	КонецЕсли;
	
	ОбучениеРазвитие.ПроверитьТабличнуюЧастьСотрудниковНаДублиФизическихЛиц(ЭтотОбъект, Отказ);
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты,МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.МероприятияОбученияРазвития") Тогда
		
		Мероприятие = ДанныеЗаполнения;
		// Заполнение табличной части "Расходы".
		МероприятиеСтруктураРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Мероприятие,
			"Наименование, Стоимость, СпособОпределенияСтоимости");
		ОбучениеРазвитие.ЗаполнитьТабличнуюЧастьРасходовПоМероприятию(МероприятиеСтруктураРеквизитов, Расходы, Сотрудники.Количество());
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаНаВключениеВПланОбучения") Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения, "Подразделение, Мероприятие, ДатаНачала, ДатаОкончания, Комментарий");
		Сотрудники.Загрузить(ДанныеЗаполнения.Сотрудники.Выгрузить());
		Расходы.Загрузить(ДанныеЗаполнения.Расходы.Выгрузить());
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда // Заполнение по данным плана.
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект,ДанныеЗаполнения,"Подразделение, Мероприятие, ДатаНачала, ДатаОкончания");
		
		МероприятиеСтруктураРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Мероприятие, "Наименование");
		
		// Заполнение табличной части "Сотрудники".
		Сотрудники.Очистить();
		Для каждого Сотрудник Из ДанныеЗаполнения.Сотрудники Цикл
			НовыйСотрудник = Сотрудники.Добавить();
			НовыйСотрудник.Сотрудник = Сотрудник;
		КонецЦикла;
		
		// Заполнение табличной части "Расходы".
		Расходы.Очистить();
		Если Сотрудники.Количество() > 0 Тогда
			НоваяСтрокаРасходов = Расходы.Добавить();
			НоваяСтрокаРасходов.Сумма = СуммаРасходов;
			НоваяСтрокаРасходов.Примечание = ОбучениеРазвитие.ПримечаниеРасходовНаОбучение(
				МероприятиеСтруктураРеквизитов.Наименование, Сотрудники.Количество());
		КонецЕсли;
		
	КонецЕсли;
	
	СуммаРасходов = Расходы.Итог("Сумма");
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Статус = ПредопределенноеЗначение("Перечисление.СостоянияСогласования.ПустаяСсылка");
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
